Revit 2027 API
ReferencePointArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ReferencePointArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As ReferencePointArrayIterator
public:
virtual ReferencePointArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> ReferencePointArrayIterator
override ForwardIterator : unit -> ReferencePointArrayIterator
Return Value
ReferencePointArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
ReferencePointArray Class
Autodesk.Revit.DB Namespace